# Liechtenstein Tax Code For Individuals And Entities

## Introduction

The function `clean_li_peid()` cleans a column containing Liechtenstein tax code for individuals and entity (PEID) strings, and standardizes them in a given format. The function `validate_li_peid()` validates either a single PEID strings, a column of PEID strings or a DataFrame of PEID strings, returning `True` if the value is valid, and `False` otherwise.

PEID strings can be converted to the following formats via the `output_format` parameter:

* `compact`: only number strings without any seperators or whitespace, like "1234567"
* `standard`: PEID strings with proper whitespace in the proper places. Note that in the case of PEID, the compact format is the same as the standard one.

Invalid parsing is handled with the `errors` parameter:

* `coerce` (default): invalid parsing will be set to NaN
* `ignore`: invalid parsing will return the input
* `raise`: invalid parsing will raise an exception

The following sections demonstrate the functionality of `clean_li_peid()` and `validate_li_peid()`.

### An example dataset containing PEID strings

In [1]:
import pandas as pd
import numpy as np
df = pd.DataFrame(
    {
        "peid": [
            '00001234567',
            '00001234568913454545',
            'BE 428759497',
            'BE431150351',
            "002 724 334",
            "hello",
            np.nan,
            "NULL",
        ], 
        "address": [
            "123 Pine Ave.",
            "main st",
            "1234 west main heights 57033",
            "apt 1 789 s maple rd manhattan",
            "robie house, 789 north main street",
            "1111 S Figueroa St, Los Angeles, CA 90015",
            "(staples center) 1111 S Figueroa St, Los Angeles",
            "hello",
        ]
    }
)
df

                   peid                                           address
0           00001234567                                     123 Pine Ave.
1  00001234568913454545                                           main st
2          BE 428759497                      1234 west main heights 57033
3           BE431150351                    apt 1 789 s maple rd manhattan
4           002 724 334                robie house, 789 north main street
5                 hello         1111 S Figueroa St, Los Angeles, CA 90015
6                   NaN  (staples center) 1111 S Figueroa St, Los Angeles
7                  NULL                                             hello

## 1. Default `clean_li_peid`

By default, `clean_li_peid` will clean peid strings and output them in the standard format with proper separators.

In [2]:
from dataprep.clean import clean_li_peid
clean_li_peid(df, column = "peid")

,peid,address,peid_clean
0,00001234567,123 Pine Ave.,1234567
1,00001234568913454545,main st,NaN
2,BE 428759497,1234 west main heights 57033,NaN
3,BE431150351,apt 1 789 s maple rd manhattan,NaN
4,002 724 334,"robie house, 789 north main street",2724334
5,hello,"1111 S Figueroa St, Los Angeles, CA 90015",NaN
6,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
7,NULL,hello,NaN

## 2. Output formats

This section demonstrates the output parameter.

### `standard` (default)

In [3]:
clean_li_peid(df, column = "peid", output_format="standard")

,peid,address,peid_clean
0,00001234567,123 Pine Ave.,1234567
1,00001234568913454545,main st,NaN
2,BE 428759497,1234 west main heights 57033,NaN
3,BE431150351,apt 1 789 s maple rd manhattan,NaN
4,002 724 334,"robie house, 789 north main street",2724334
5,hello,"1111 S Figueroa St, Los Angeles, CA 90015",NaN
6,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
7,NULL,hello,NaN

### `compact`

In [4]:
clean_li_peid(df, column = "peid", output_format="compact")

,peid,address,peid_clean
0,00001234567,123 Pine Ave.,1234567
1,00001234568913454545,main st,NaN
2,BE 428759497,1234 west main heights 57033,NaN
3,BE431150351,apt 1 789 s maple rd manhattan,NaN
4,002 724 334,"robie house, 789 north main street",2724334
5,hello,"1111 S Figueroa St, Los Angeles, CA 90015",NaN
6,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
7,NULL,hello,NaN

## 3. `inplace` parameter

This deletes the given column from the returned DataFrame. 
A new column containing cleaned PEID strings is added with a title in the format `"{original title}_clean"`.

In [5]:
clean_li_peid(df, column="peid", inplace=True)

  peid_clean                                           address
0    1234567                                     123 Pine Ave.
1        NaN                                           main st
2        NaN                      1234 west main heights 57033
3        NaN                    apt 1 789 s maple rd manhattan
4    2724334                robie house, 789 north main street
5        NaN         1111 S Figueroa St, Los Angeles, CA 90015
6        NaN  (staples center) 1111 S Figueroa St, Los Angeles
7        NaN                                             hello

## 4. `errors` parameter

### `coerce` (default)

In [6]:
clean_li_peid(df, "peid", errors="coerce")

,peid,address,peid_clean
0,00001234567,123 Pine Ave.,1234567
1,00001234568913454545,main st,NaN
2,BE 428759497,1234 west main heights 57033,NaN
3,BE431150351,apt 1 789 s maple rd manhattan,NaN
4,002 724 334,"robie house, 789 north main street",2724334
5,hello,"1111 S Figueroa St, Los Angeles, CA 90015",NaN
6,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
7,NULL,hello,NaN

### `ignore`

In [7]:
clean_li_peid(df, "peid", errors="ignore")

,peid,address,peid_clean
0,00001234567,123 Pine Ave.,1234567
1,00001234568913454545,main st,00001234568913454545
2,BE 428759497,1234 west main heights 57033,BE 428759497
3,BE431150351,apt 1 789 s maple rd manhattan,BE431150351
4,002 724 334,"robie house, 789 north main street",2724334
5,hello,"1111 S Figueroa St, Los Angeles, CA 90015",hello
6,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
7,NULL,hello,NaN

## 4. `validate_li_peid()`

`validate_li_peid()` returns `True` when the input is a valid PEID. Otherwise it returns `False`.

The input of `validate_li_peid()` can be a string, a Pandas DataSeries, a Dask DataSeries, a Pandas DataFrame and a dask DataFrame.

When the input is a string, a Pandas DataSeries or a Dask DataSeries, user doesn't need to specify a column name to be validated. 

When the input is a Pandas DataFrame or a dask DataFrame, user can both specify or not specify a column name to be validated. If user specify the column name, `validate_li_peid()` only returns the validation result for the specified column. If user doesn't specify the column name, `validate_li_peid()` returns the validation result for the whole DataFrame.

In [8]:
from dataprep.clean import validate_li_peid
print(validate_li_peid("00001234567"))
print(validate_li_peid("00001234568913454545"))
print(validate_li_peid('BE 428759497'))
print(validate_li_peid('BE431150351'))
print(validate_li_peid("004085616"))
print(validate_li_peid("hello"))
print(validate_li_peid(np.nan))
print(validate_li_peid("NULL"))

True
False
False
False
True
False
False
False

### Series

In [9]:
validate_li_peid(df["peid"])

0     True
1    False
2    False
3    False
4     True
5    False
6    False
7    False
Name: peid, dtype: bool

### DataFrame + Specify Column

In [10]:
validate_li_peid(df, column="peid")

0     True
1    False
2    False
3    False
4     True
5    False
6    False
7    False
Name: peid, dtype: bool

### Only DataFrame

In [11]:
validate_li_peid(df)

    peid  address
0   True    False
1  False    False
2  False    False
3  False    False
4   True    False
5  False    False
6  False    False
7  False    False